The  BaseImportOptions  type exposes the following members.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  BaseImportOptions
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetLayerSelection
 Get all set layers name which user want to import into Revit.
GetRefPoint   |     Obsolete.
 Gets the 3D point in the document where the imported instance will be inserted.
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
SetLayerSelection
 Set the layers name which user want to import into Revit.
SetRefPoint   |     Obsolete.
 Sets the 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
AutoCorrectAlmostVHLines
 Correct almost-vertical lines and almost-horizontal lines for import model if option is set to true, the almost-vertical lines would be vertical lines and almost-horizontal lines would be horizontal lines.
ColorMode
 Color mode for the import. Three modes are supported. Black and White, Preserve Colors, and Invert Colors.
CustomScale
 Scaling the import. If this is defined and a valid value (> 0.0), it takes preference over units.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
OrientToView
 Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
Placement
 Where to place the import. Set this option to place the view at the origin or the center, or a shared coordinates.
ReferencePoint
 The 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
ThisViewOnly
 Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
Unit
 The unit of measure for imported geometry.
VisibleLayersOnly
 Only import the visible layers.
 See Also
  BaseImportOptions Class
  Autodesk.Revit.DB Namespace